ryanuo/cstudy/stm32/test407/App/OLED.c

/***************************************************************************************
  * @file    OLED.c
  * @brief   SSD1306 OLED (128x64) driver, software I2C on PB8/PB9
  * @note    Drawing functions operate on OLED_DisplayBuf; call OLED_Update() to refresh.
  ***************************************************************************************
  */

#include "stm32f4xx_hal.h"
#include "OLED.h"
#include <string.h>
#include <math.h>
#include <stdio.h>
#include <stdarg.h>

/* 软件 I2C 引脚定义 */
#define OLED_SCL_PORT  GPIOB
#define OLED_SCL_PIN   GPIO_PIN_8
#define OLED_SDA_PORT  GPIOB
#define OLED_SDA_PIN   GPIO_PIN_9

static GPIO_InitTypeDef oled_gpio = {0};

/**
  * @brief  软件 I2C 位延时
  * @note   江协这套驱动原本跑在 72MHz 的 F103 上，移植到 168MHz 的 F407 后
  *         SCL 速度翻了一倍多，SSD1306 采样不到会整屏不显示。
  *         这里插空循环把 SCL 压到约 200~250kHz。
  */
static void OLED_I2C_Delay(void) {
    for (volatile uint32_t i = 0; i < 40U; i++) {
    }
}

static void OLED_W_SCL(uint8_t BitValue) {
    HAL_GPIO_WritePin(OLED_SCL_PORT, OLED_SCL_PIN, (GPIO_PinState)BitValue);
    OLED_I2C_Delay();
}

static void OLED_W_SDA(uint8_t BitValue) {
    HAL_GPIO_WritePin(OLED_SDA_PORT, OLED_SDA_PIN, (GPIO_PinState)BitValue);
    OLED_I2C_Delay();
}

static void OLED_GPIO_Init(void) {
    __HAL_RCC_GPIOB_CLK_ENABLE();
    oled_gpio.Pin = OLED_SCL_PIN | OLED_SDA_PIN;
    oled_gpio.Mode = GPIO_MODE_OUTPUT_OD;
    oled_gpio.Pull = GPIO_PULLUP;
    oled_gpio.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOB, &oled_gpio);
    HAL_GPIO_WritePin(GPIOB, OLED_SCL_PIN | OLED_SDA_PIN, GPIO_PIN_SET);
}

/**
  * @brief  Bitmap data layout used by this driver
  *
  *      B0 B0                  B0 B0
  *      B1 B1                  B1 B1
  *      B2 B2                  B2 B2
  *      B3 B3  ------------->  B3 B3 --
  *      B4 B4                  B4 B4  |
  *      B5 B5                  B5 B5  |
  *      B6 B6                  B6 B6  |
  *      B7 B7                  B7 B7  |
  *                                    |
  *  -----------------------------------
  *  |   
  *  |   B0 B0                  B0 B0
  *  |   B1 B1                  B1 B1
  *  |   B2 B2                  B2 B2
  *  --> B3 B3  ------------->  B3 B3
  *      B4 B4                  B4 B4
  *      B5 B5                  B5 B5
  *      B6 B6                  B6 B6
  *      B7 B7                  B7 B7
  * 
  * 
  *      .------------------------------->
  *    0 |
  *      |
  *      |
  *      |
  *      |
  *      |
  *      |
  *   63 |
  *      v
  * 
  */



/**
  * @brief  OLED display buffer, 8 pages x 128 columns
  */
uint8_t OLED_DisplayBuf[8][128];









/**
  * @brief  Generate I2C start condition
  */
void OLED_I2C_Start(void)
{
	OLED_W_SDA(1);
	OLED_W_SCL(1);
	OLED_W_SDA(0);
	OLED_W_SCL(0);
}

/**
  * @brief  Generate I2C stop condition
  */
void OLED_I2C_Stop(void)
{
	OLED_W_SDA(0);
	OLED_W_SCL(1);
	OLED_W_SDA(1);
}

/**
  * @brief  Send one byte over software I2C, MSB first
  * @param  Byte: data byte to send
  */
void OLED_I2C_SendByte(uint8_t Byte)
{
	uint8_t i;
	
	for (i = 0; i < 8; i++)
	{
		OLED_W_SDA(!!(Byte & (0x80 >> i)));
		OLED_W_SCL(1);
		OLED_W_SCL(0);
	}
	
	OLED_W_SCL(1);
	OLED_W_SCL(0);
}

/**
  * @brief  Write one command byte to OLED
  * @param  Command: command byte
  */
void OLED_WriteCommand(uint8_t Command)
{
	OLED_I2C_Start();
	OLED_I2C_SendByte(0x78);
	OLED_I2C_SendByte(0x00);
	OLED_I2C_SendByte(Command);
	OLED_I2C_Stop();
}

/**
  * @brief  Write a burst of display data to OLED (GDDRAM)
  * @param  Data: data buffer, Count: number of bytes
  */
void OLED_WriteData(uint8_t *Data, uint8_t Count)
{
	uint8_t i;
	
	OLED_I2C_Start();
	OLED_I2C_SendByte(0x78);
	OLED_I2C_SendByte(0x40);
	for (i = 0; i < Count; i ++)
	{
		OLED_I2C_SendByte(Data[i]);
	}
	OLED_I2C_Stop();
}




/**
  * @brief  Initialize OLED: GPIO, software I2C and SSD1306 registers
  */
void OLED_Init(void)
{
	OLED_GPIO_Init();
	HAL_Delay(100);			/* 等 SSD1306 上电稳定再发命令 */

	OLED_WriteCommand(0xAE);
	
	OLED_WriteCommand(0xD5);
	OLED_WriteCommand(0x80);	//0x00~0xFF
	
	OLED_WriteCommand(0xA8);
	OLED_WriteCommand(0x3F);	//0x0E~0x3F
	
	OLED_WriteCommand(0xD3);
	OLED_WriteCommand(0x00);	//0x00~0x7F
	
	OLED_WriteCommand(0x40);
	
	OLED_WriteCommand(0xA1);
	
	OLED_WriteCommand(0xC8);

	OLED_WriteCommand(0xDA);
	OLED_WriteCommand(0x12);
	
	OLED_WriteCommand(0x81);
	OLED_WriteCommand(0xCF);	//0x00~0xFF

	OLED_WriteCommand(0xD9);
	OLED_WriteCommand(0xF1);

	OLED_WriteCommand(0xDB);
	OLED_WriteCommand(0x30);

	OLED_WriteCommand(0xA4);

	OLED_WriteCommand(0xA6);

	OLED_WriteCommand(0x8D);
	OLED_WriteCommand(0x14);

	OLED_WriteCommand(0xAF);
	
	OLED_Clear();
	OLED_Update();
}

/**
  * @brief  Set cursor position
  * @param  Page: page address 0~7, X: column address 0~127
  */
void OLED_SetCursor(uint8_t Page, uint8_t X)
{
//	X += 2;
	
	OLED_WriteCommand(0xB0 | Page);
	OLED_WriteCommand(0x10 | ((X & 0xF0) >> 4));
	OLED_WriteCommand(0x00 | (X & 0x0F));
}





/**
  * @brief  Integer power: X raised to the power of Y
  * @param  X: base, Y: exponent
  * @retval X^Y
  */
uint32_t OLED_Pow(uint32_t X, uint32_t Y)
{
	uint32_t Result = 1;
	while (Y --)
	{
		Result *= X;
	}
	return Result;
}

/**
  * @brief  Point-in-polygon test (ray casting algorithm)
  * @param  nvert: vertex count, vertx/verty: vertex arrays, testx/testy: point to test
  * @retval 1 if inside, 0 otherwise
  */
uint8_t OLED_pnpoly(uint8_t nvert, int16_t *vertx, int16_t *verty, int16_t testx, int16_t testy)
{
	int16_t i, j, c = 0;
	
	for (i = 0, j = nvert - 1; i < nvert; j = i++)
	{
		if (((verty[i] > testy) != (verty[j] > testy)) &&
			(testx < (vertx[j] - vertx[i]) * (testy - verty[i]) / (verty[j] - verty[i]) + vertx[i]))
		{
			c = !c;
		}
	}
	return c;
}

/**
  * @brief  Check whether a point falls inside the given angle range
  * @param  X/Y: point, StartAngle/EndAngle: angle range in degrees
  * @retval 1 if inside, 0 otherwise
  */
uint8_t OLED_IsInAngle(int16_t X, int16_t Y, int16_t StartAngle, int16_t EndAngle)
{
	int16_t PointAngle;
	PointAngle = atan2(Y, X) / 3.14 * 180;
	if (StartAngle < EndAngle)
	{
		if (PointAngle >= StartAngle && PointAngle <= EndAngle)
		{
			return 1;
		}
	}
	else
	{
		if (PointAngle >= StartAngle || PointAngle <= EndAngle)
		{
			return 1;
		}
	}
	return 0;
}




/**
  * @brief  Push the whole display buffer to OLED (full refresh)
  */
void OLED_Update(void)
{
	uint8_t j;
	for (j = 0; j < 8; j ++)
	{
		OLED_SetCursor(j, 0);
		OLED_WriteData(OLED_DisplayBuf[j], 128);
	}
}

/**
  * @brief  Push only the given rectangular area to OLED (partial refresh)
  * @param  X/Y: top-left, Width/Height: area size
  */
void OLED_UpdateArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height)
{
	int16_t j;
	int16_t Page, Page1;
	
